Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.СтруктурныеЕдиницы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКассККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьВыемку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПоступлениеВКассу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДляРозничнойВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйОстатокВКассеККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвторизациюПоОтветственному</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФИОКассираВЧеке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиФИОКассираВЧекеККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблонЧекаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблонЧекаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОфлайнОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОфлайнОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПечататьБумажныйЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьСДаннымиОФД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаВозврата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОтветственногоВЧекеИзЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СопоставлениеНоменклатурыОФД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеНоменклатурыОФД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКассККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКассККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтономнаяККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМED</Name>
					<Comment>ККМ из другой программы, участвующая в обмене через EnterpriseData</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыОфлайнОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОфлайнОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЧекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиФИОКассираВЧекеККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ИсточникиФИОКассираВЧекеККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПодключаемогоОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КассыККМ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		Объект.ВалютаДенежныхСредств = Константы.НациональнаяВалюта.Получить();
	КонецЕсли;
	
	Если Параметры.ПараметрыВыбора.Свойство("СтруктурнаяЕдиница")
		И ЗначениеЗаполнено(Параметры.ПараметрыВыбора.СтруктурнаяЕдиница) Тогда
		Объект.СтруктурнаяЕдиница = Параметры.ПараметрыВыбора.СтруктурнаяЕдиница;
	КонецЕсли;
	
	Если Параметры.ПараметрыВыбора.Свойство("ТипКассы") Тогда
		Элементы.ТипКассы.Доступность = Ложь;
	КонецЕсли;

	ИспользоватьПодключаемоеОборудование = Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
	   И НЕ Параметры.ЗначенияЗаполнения.Свойство("Владелец")
	   И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Объект.Владелец = ЗначениеНастройки;
		Иначе
			Объект.Владелец = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
		Если НЕ ИспользоватьПодключаемоеОборудование Тогда
			Объект.ИспользоватьБезПодключенияОборудования = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТипКассыПриИзмененииНаСервере();
	
	Если Объект.ИспользоватьБезПодключенияОборудования
	И НЕ Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить() Тогда
		Элементы.ИспользоватьБезПодключенияОборудования.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ПодключаемоеОборудование.Доступность = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	Элементы.ИсточникФИОКассираВЧеке.Доступность = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	
	Если ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
		Элементы.ТипКассы.СписокВыбора.Добавить(Перечисления.ТипыКассККМ.АвтономнаяККМ);
		Элементы.ТипКассы.СписокВыбора.Добавить(Перечисления.ТипыКассККМ.ККМED);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованиемOffline") Тогда
		Элементы.ТипКассы.СписокВыбора.Добавить(Перечисления.ТипыКассККМ.ККМOffline);
		Элементы.ТипКассы.СписокВыбора.Добавить(Перечисления.ТипыКассККМ.СервисОборудования);
	КонецЕсли;
	
	Элементы.Владелец.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	УстановитьВидимостьДопСвойств();
	
	Элементы.РеквизитыККТ.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Элементы.ГруппаПечать.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	
	ФОУчетПоНесколькимСкладам = ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам");
	Элементы.ГруппаОткрытьКарточкуСклада.Видимость = НЕ ФОУчетПоНесколькимСкладам;
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ Объект.ОфлайнОборудование.ТипОфлайнОборудования = Перечисления.ТипыОфлайнОборудования.ОФД Тогда
		Элементы.ЗагрузитьДанныеОПродажах.Видимость = Ложь;
	КонецЕсли;
	
	// Переход с предыдущих версий
	Если Объект.ИсточникФИОКассираВЧеке.Пустая() Тогда
		Объект.ИсточникФИОКассираВЧеке = Перечисления.ИсточникиФИОКассираВЧекеККМ.Автор;
	КонецЕсли;
	// Конец Переход с предыдущих версий

	ПересчитатьФормуНаСервере();	
    НастроитьФорму(ЭтотОбъект);

	ПоказыватьИнформациюПоОблачнойКассе				= ХранилищеСистемныхНастроек.Загрузить(
		"КассыККМ", 
		"КассыККМ_ПоказыватьИнформациюПоОблачнойКассе");

	Элементы.ГруппаИнформацияПоОблачнойКассе.Видимость = (ПоказыватьИнформациюПоОблачнойКассе <> Ложь);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьАвтоНаименование();
	ЗаполнитьEmail();
	ЗаполнитьSMS();
	НастроитьВидимостьЭлементовАвтоинкассации();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьСчетаКассыККМ" Тогда
		Объект.СчетУчета = Параметр.СчетУчета;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НужноОбновитьЗначения = Ложь;
	ПараметрыККМ = УправлениеНебольшойФирмойПовтИсп.ПолучитьПараметрыКассыККМ(Объект.Ссылка);
	Если Объект.СоздаватьВыемку <> ПараметрыККМ.СоздаватьВыемку Тогда
		НужноОбновитьЗначения = Истина;
	КонецЕсли;
	Если Объект.СоздаватьПоступлениеВКассу <> ПараметрыККМ.СоздаватьПоступлениеВКассу Тогда
		НужноОбновитьЗначения = Истина;
	КонецЕсли;
	Если Объект.МинимальныйОстатокВКассеККМ <> ПараметрыККМ.МинимальныйОстатокВКассеККМ Тогда
		НужноОбновитьЗначения = Истина;
	КонецЕсли;
	Если Объект.КассаДляРозничнойВыручки <> ПараметрыККМ.КассаДляРозничнойВыручки Тогда
		НужноОбновитьЗначения = Истина;
	КонецЕсли;
	
	Если НужноОбновитьЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// подсистема запрета редактирования ключевых реквизитов объектов	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИнформацияПоОблачнойКассеЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаИнформацияПоОблачнойКассе.Видимость = Ложь;
	СохранитьНастройкуПоказыватьИнформациюПоОблачнойКассе();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКассыПриИзменении(Элемент)
	
	ТипКассыПриИзмененииНаСервере();
	СформироватьАвтоНаименование();
	НастроитьВидимостьЭлементовАвтоинкассации();
	
КонецПроцедуры // ТипКассыПриИзменении()

&НаКлиенте
Процедура ПодключаемоеОборудованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаОбъекта", Новый Структура("Ключ", Объект.ПодключаемоеОборудование));
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБезПодключенияОборудованияПриИзменении(Элемент)
	
	Элементы.ПодключаемоеОборудование.Доступность = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	Элементы.ИсточникФИОКассираВЧеке.Доступность = НЕ Объект.ИспользоватьБезПодключенияОборудования;
	УстановитьВидимостьДопСвойств();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	СформироватьАвтоНаименование();
	ПересчитатьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьВыемкуПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементовАвтоинкассации();

	НастроитьФорму(ЭтотОбъект, "ГруппаАвтоинкассация");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьПоступлениеВКассуПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементовАвтоинкассации();
	Если Объект.СоздаватьПоступлениеВКассу И Объект.КассаДляРозничнойВыручки.Пустая() Тогда
		Объект.КассаДляРозничнойВыручки = ЗаполнитьКассуДляВыручкиПоУмолчанию();
	КонецЕсли;

	НастроитьФорму(ЭтотОбъект, "ГруппаАвтоинкассация");

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастроитьКассовыйQRКодОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПродолжениеНастройки = Новый ОписаниеОповещения("НастроитьКассовыйQRКодЗавершение", ЭтотОбъект);
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьВопрос(
			ПродолжениеНастройки, 
			НСтр("ru='Для подключения кассового QR-кода необходимо записать объект.
				|Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ПродолжениеНастройки, КодВозвратаДиалога.Да);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКассовыйQRКодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ПродолжатьВыполнениеДействия = РезультатВопроса = КодВозвратаДиалога.Да;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка)
			И Не Записать() Тогда
			ПродолжатьВыполнениеДействия = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Если ПродолжатьВыполнениеДействия Тогда

		ПересчитатьНастройкиСБП = Новый ОписаниеОповещения("ПересчитатьНастройкиСБП", ЭтотОбъект);
		
		ИнтеграцияСПлатежнымиСистемамиУНФКлиент.ОткрытьФормуНастройкиКассовогоQRКода(
			Объект.Ссылка,
			Объект.Владелец,
			Объект.СтруктурнаяЕдиница,
			ПересчитатьНастройкиСБП);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ПересчитатьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НеПечататьБумажныйЧекПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЧекаПродажиПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЧекаВозвратаПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвторизациюПоОтветственномуПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемоеОборудованиеПриИзменении(Элемент)
	ПодключаемоеОборудованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура EmailПриИзменении(Элемент)
	
	Объект.ЭлектронныйЧекEmailПередаютсяПрограммой1С = Email = "ИзПриложения";
    НастроитьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура SMSПриИзменении(Элемент)
	
	Объект.ЭлектронныйЧекSMSПередаютсяПрограммой1С = SMS = "ИзПриложения";
    НастроитьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КассаДляРозничнойВыручкиПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, "ГруппаАвтоинкассация");
	
КонецПроцедуры

&НаКлиенте
Процедура МинимальныйОстатокВКассеККМПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, "ГруппаАвтоинкассация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОфлайнОборудованиеПриИзменении(Элемент)
	
	ОфлайнОборудованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СверятьСДаннымиОФДПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиОФДНажатие(Элемент)
	
	ОповещениеОФД = Новый ОписаниеОповещения("НастройкиОФДНажатиеЗавершение", ЭтотОбъект);
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьВопрос(
			ОповещениеОФД, 
			НСтр("ru='Для настройки интеграции с сервисом ОФД необходимо записать объект.
				|Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОФД, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОФДНажатиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПродолжитьНастройку = РезультатВопроса = КодВозвратаДиалога.Да;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка)
			И Не Записать() Тогда
			ПродолжитьНастройку = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПродолжитьНастройку Тогда
		
		МодульОФД = ОбщегоНазначенияКлиент.ОбщийМодуль("ОФДКлиент");
		
		НастройкиПодключения = Новый Структура;
		НастройкиПодключения.Вставить("Касса", Объект.Ссылка);
		
		МодульОФД.ПараметрыПодключения(НастройкиПодключения, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникФИОКассираВЧекеПриИзменении(Элемент)
	
	Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Доступность =
		Объект.ИсточникФИОКассираВЧеке = ПредопределенноеЗначение("Перечисление.ИсточникиФИОКассираВЧекеККМ.Автор");
	Если НЕ Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Доступность Тогда
		Объект.ЗаполнятьОтветственногоВЧекеИзЗаказа = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСклады(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ОсновнойСклад"));
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеОФД(Команда)
	
	ОповещениеОВыполнении = Новый ОписаниеОповещения(
		"КассыОФДЗагрузкаОтчетовЗавершение",
		ЭтотОбъект);
	МенеджерОфлайнОборудованияКлиент.НачатьЗагрузкуДанныхИзККМ(Объект.ОфлайнОборудование, УникальныйИдентификатор, ОповещениеОВыполнении);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует наименование банковского счета.
//
&НаКлиенте
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = "" + Объект.ТипКассы + " (" + Объект.СтруктурнаяЕдиница + ")";
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции

&НаСервере
Процедура СброситьОборудованиеИПризнакиККТ()
	
	Объект.ПодключаемоеОборудование = Неопределено;
	Объект.ЭлектронныйЧекSMSПередаютсяПрограммой1С = Ложь;
	Объект.ЭлектронныйЧекEmailПередаютсяПрограммой1С = Ложь;
	Email = "ЧерезОФД";
	SMS = "ЧерезОФД";
	
КонецПроцедуры

&НаСервере
Процедура ТипКассыПриИзмененииНаСервере()
	
	Если Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
		
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Истина;
		Элементы.ПодключаемоеОборудование.Видимость = Истина;
		Элементы.ИсточникФИОКассираВЧеке.Видимость = Истина;
		Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Видимость = Истина;
		Элементы.ОфлайнОборудование.Видимость = Ложь;
		
		ПараметрыВыбораПодключаемогоОборудования = Новый Массив;
		
		Значения = Новый Массив;
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ"));
		Значения.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ"));
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.ТипОборудования", Значения));
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.УстройствоИспользуется", Истина));
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
		
		Элементы.ПодключаемоеОборудование.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПодключаемогоОборудования);
		
		Если Объект.ПодключаемоеОборудование.ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор
			И Объект.ПодключаемоеОборудование.ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ККТ 
			И Объект.ПодключаемоеОборудование.ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			СброситьОборудованиеИПризнакиККТ();
		КонецЕсли;
		
		Если Объект.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			Элементы.ГруппаАвтоинкассация.Видимость = Ложь;
			Элементы.ГруппаАвторизация.Видимость 	= Ложь;
		КонецЕсли;
		
		Элементы.СтруктурнаяЕдиница.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
	ИначеЕсли Объект.ТипКассы = Перечисления.ТипыКассККМ.ККМOffline Тогда
		
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Ложь;
		Элементы.ПодключаемоеОборудование.Видимость = Ложь;
		Элементы.ОфлайнОборудование.Видимость = Истина;
		Элементы.ИсточникФИОКассираВЧеке.Видимость = Ложь;
		Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Видимость = Ложь;
		
		ПараметрыВыбораПодключаемогоОборудования = Новый Массив;
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.ТипОборудования", Перечисления.ТипыОфлайнОборудования.ККМ));
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
		
		Элементы.ОфлайнОборудование.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПодключаемогоОборудования);
		
		Если Объект.ПодключаемоеОборудование.ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.УдалитьККМОфлайн Тогда
			СброситьОборудованиеИПризнакиККТ();
		КонецЕсли; 
		
		Элементы.СтруктурнаяЕдиница.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		
	ИначеЕсли Объект.ТипКассы = Перечисления.ТипыКассККМ.СервисОборудования Тогда
		
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Ложь;
		Элементы.ПодключаемоеОборудование.Видимость = Истина;
		Элементы.ИсточникФИОКассираВЧеке.Видимость = Ложь;
		Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Видимость = Ложь;
		
		ПараметрыВыбораПодключаемогоОборудования = Новый Массив;
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.УстройствоИспользуется", Истина));
		ПараметрыВыбораПодключаемогоОборудования.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
		
		Элементы.ПодключаемоеОборудование.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПодключаемогоОборудования);
		
		СброситьОборудованиеИПризнакиККТ();
		
	ИначеЕсли Объект.ТипКассы = Перечисления.ТипыКассККМ.ККМED Тогда
		
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Ложь;
		Элементы.ПодключаемоеОборудование.Видимость = Ложь;
		Элементы.ИсточникФИОКассираВЧеке.Видимость = Ложь;
		Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Видимость = Ложь;
		Элементы.ОфлайнОборудование.Видимость = Ложь;
		
	Иначе
		
		Элементы.ИспользоватьБезПодключенияОборудования.Видимость = Ложь;
		Элементы.ПодключаемоеОборудование.Видимость = Ложь;
		Элементы.ИсточникФИОКассираВЧеке.Видимость = Ложь;
		Элементы.ЗаполнятьОтветственногоВЧекеИзЗаказа.Видимость = Ложь;
		Элементы.ОфлайнОборудование.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьВидимостьДопСвойств();
	
КонецПроцедуры // ТипКассыПриИзмененииНаСервере()

&НаКлиенте
Процедура НастроитьВидимостьЭлементовАвтоинкассации()
	
	ОблачнаяККТ				 = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ");
	ЭтоФискальныйРегистратор = (Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ФискальныйРегистратор"));
	ЭтоККМED = (Объект.ТипКассы = ПредопределенноеЗначение("Перечисление.ТипыКассККМ.ККМED"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ГруппаАвтоинкассация", 
		"Видимость", 
		(ЭтоФискальныйРегистратор ИЛИ ЭтоККМED) И Не Объект.ТипОборудования = ОблачнаяККТ);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ГруппаПВК", 
		"Видимость", 
		ЭтоФискальныйРегистратор И НЕ ЭтоККМED);
	
	Если Не (ЭтоФискальныйРегистратор ИЛИ ЭтоККМED) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МинимальныйОстатокВКассеККМ", "Доступность", Объект.СоздаватьВыемку);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПВК", "Доступность", Объект.СоздаватьВыемку);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КассаДляРозничнойВыручки", "Доступность", Объект.СоздаватьПоступлениеВКассу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КассаДляРозничнойВыручки", "ОтметкаНезаполненного", Объект.СоздаватьПоступлениеВКассу);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьКассуДляВыручкиПоУмолчанию()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Кассы.Ссылка КАК Касса
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Касса;
	Иначе
		Возврат Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение",
			ЭтотОбъект);
		ОткрытьФорму("Справочник.КассыККМ.Форма.РазрешитьРедактирование", , , , , , Оповещение);
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта()

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат,Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПодключаемоеОборудованиеПриИзмененииНаСервере()
	
	ОблачнаяККТ 					 = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ;
	
	Объект.СерийныйНомер 			 = Объект.ПодключаемоеОборудование.СерийныйНомер;
	Объект.ТипОборудования 			 = Объект.ПодключаемоеОборудование.ТипОборудования;

	Если ЗначениеЗаполнено(Объект.ПодключаемоеОборудование)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПодключаемоеОборудование, "ТипОборудования") = ОблачнаяККТ Тогда

		Объект.НеПечататьБумажныйЧек = Истина;
		
	КонецЕсли;
	
	УстановитьВидимостьДопСвойств();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДопСвойств()

	Если Не ЗначениеЗаполнено(Объект.ТипКассы)
		Или Объект.ТипКассы = Перечисления.ТипыКассККМ.АвтономнаяККМ
		Или Объект.ТипКассы = Перечисления.ТипыКассККМ.ККМED
		Или Объект.ТипКассы = Перечисления.ТипыКассККМ.ККМOffline
		Или Объект.ТипКассы = Перечисления.ТипыКассККМ.СервисОборудования Тогда

		Элементы.ИспользоватьАвторизациюПоОтветственному.Видимость 	= Ложь;        
		Элементы.ГруппаНастройкиСБП.Видимость						= Ложь;
			
	Иначе

		ИнтеграцияДоступна = ИнтеграцияСПлатежнымиСистемамиУНФПовтИсп.ИнтеграцияДоступна();
		
		Элементы.ИспользоватьАвторизациюПоОтветственному.Видимость = Истина;
		Элементы.ГруппаНастройкиСБП.Видимость					   = ИнтеграцияДоступна;
			
	КонецЕсли;

	Элементы.ГруппаВыводИнформацииПоОблачнойКассе.Видимость		= Ложь;  
	Элементы.ГруппаШаблоныЧеков.Видимость						= Истина;
	
	Если Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
		Если Объект.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			Элементы.РеквизитыККТ.Видимость = Истина;
			Элементы.ГруппаПечать.Видимость = Истина;
			Элементы.ГруппаОФД.Видимость    = Истина;
		ИначеЕсли Объект.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
			Элементы.РеквизитыККТ.Видимость = Ложь;
			Элементы.ГруппаПечать.Видимость = Истина;
			Элементы.ГруппаОФД.Видимость    = Ложь;
		ИначеЕсли Объект.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			
			Элементы.ГруппаНастройкиСБП.Видимость 	= Ложь;
			Элементы.РеквизитыККТ.Видимость 		= Ложь;
			Элементы.ГруппаПечать.Видимость 		= Истина;
			Элементы.ГруппаШаблоныЧеков.Видимость 	= Ложь;
			Элементы.ГруппаОФД.Видимость    		= Ложь;
			Элементы.ГруппаАвтоинкассация.Видимость = Ложь;
			
			Элементы.ИспользоватьАвторизациюПоОтветственному.Видимость 	= Ложь;
			Элементы.ГруппаВыводИнформацииПоОблачнойКассе.Видимость		= Истина;
			Элементы.ИспользоватьБезПодключенияОборудования.Видимость	= Ложь;
			
		Иначе
			Элементы.РеквизитыККТ.Видимость = Ложь;
			Элементы.ГруппаПечать.Видимость = Ложь;
			Элементы.ГруппаОФД.Видимость    = Ложь;
		КонецЕсли;
	Иначе
		Элементы.РеквизитыККТ.Видимость = Ложь;
		Элементы.ГруппаПечать.Видимость = Ложь; 
		Элементы.ГруппаОФД.Видимость    = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьБезПодключенияОборудования Тогда
		Элементы.РеквизитыККТ.Видимость = Ложь;
		Элементы.ГруппаПечать.Видимость = Ложь;
		Элементы.ГруппаОФД.Видимость    = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьEmail()
	
	Если Объект.ЭлектронныйЧекEmailПередаютсяПрограммой1С Тогда
		Email = "ИзПриложения";
	Иначе
		Email = "ЧерезОФД";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьSMS()
	
	Если Объект.ЭлектронныйЧекSMSПередаютсяПрограммой1С Тогда
		SMS = "ИзПриложения";
	Иначе
		SMS = "ЧерезОФД";
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПересчитатьФормуНаСервере()
	
	ИспользоватьQRКод = Ложь;
	СпособыОплаты	  = Новый СписокЗначений;

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНастройкиКассовогоQRКода(Объект.Ссылка, ИспользоватьQRКод, СпособыОплаты);
	КонецЕсли;
	
	ЗаголовокСсылки = НСтр("ru='Подключить кассовый QR-код СБП'");
	Если СпособыОплаты.Количество() Тогда
		ЗаголовокСсылки = СтрШаблон(НСтр("ru='Кассовые QR-коды СБП (%1)'"), СпособыОплаты.Количество())
	КонецЕсли;
	
	СсылкаПодключения = Новый ФорматированнаяСтрока(ЗаголовокСсылки,,,, "ОткрытьФОрмуПодключения");
	
	Элементы.ДекорацияНастроитьКассовыйQRКод.Заголовок = СсылкаПодключения;
	
КонецПроцедуры

// Процедура устанавливает заголовок свернутого отображения для группы, по шаблону:
// <заголовок группы (как задан в конфигураторе)> : <динамический параметр 1>, <динамический параметр 2>
//
// Параметры:
//  Форма					 - Форма	 - текущая форма
//  НазваниеГруппы			 - Строка	 - имя группы формы, для которой устанавливается заголовок
//  ДинамическиеПараметры	 - Массив из Строка - массив частей заголовка.
//
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФорму(Форма, ИмяГруппы = Неопределено)
	
	Если ИмяГруппы = "ГруппаАвтоинкассация"
		ИЛИ ИмяГруппы = Неопределено Тогда
		
		ДинамическиеПараметры = Новый Массив;
		
		Если Форма.Объект.СоздаватьВыемку Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='Создавать выемку при закрытии смены'"));
		КонецЕсли;

		Если Форма.Объект.СоздаватьПоступлениеВКассу Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='Создавать поступление в кассу при закрытии смены'"));
		КонецЕсли;
		
        УстановитьЗаголовокСвернутогоОтображения(Форма, Форма.Элементы.ГруппаАвтоинкассация.Имя, ДинамическиеПараметры);
		
	КонецЕсли;		
		
	Если ИмяГруппы = "ГруппаПечать"
		ИЛИ ИмяГруппы = Неопределено Тогда
		
		ДинамическиеПараметры = Новый Массив;
		
		Если Форма.Объект.НеПечататьБумажныйЧек Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='Не печатать бумажный чек'"));
		КонецЕсли;

		ДинамическиеПараметры.Добавить(Форма.Объект.ШаблонЧекаПродажи);
		ДинамическиеПараметры.Добавить(Форма.Объект.ШаблонЧекаВозврата);
		
        УстановитьЗаголовокСвернутогоОтображения(Форма, Форма.Элементы.ГруппаПечать.Имя, ДинамическиеПараметры);
		
	КонецЕсли;		
		
	Если ИмяГруппы = "ГруппаАвторизация"
		ИЛИ ИмяГруппы = Неопределено Тогда
		
		ДинамическиеПараметры = Новый Массив;
		
		Если Форма.Объект.ИспользоватьАвторизациюПоОтветственному Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='Использовать в РМК авторизацию по ответственному'"));
		КонецЕсли;

        УстановитьЗаголовокСвернутогоОтображения(Форма, Форма.Элементы.ГруппаАвторизация.Имя, ДинамическиеПараметры);
		
	КонецЕсли;		
		
	Если ИмяГруппы = "РеквизитыККТ"
		ИЛИ ИмяГруппы = Неопределено Тогда
		
		ДинамическиеПараметры = Новый Массив;
		
		Если Форма.Объект.ЭлектронныйЧекSMSПередаютсяПрограммой1С Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='по SMS из приложения'"));
		КонецЕсли;

		Если Форма.Объект.ЭлектронныйЧекEmailПередаютсяПрограммой1С Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='по Email из приложения'"));
		КонецЕсли;

		УстановитьЗаголовокСвернутогоОтображения(Форма, Форма.Элементы.РеквизитыККТ.Имя, ДинамическиеПараметры);
		
	КонецЕсли;
	
	Если ИмяГруппы = "ГруппаОФД"
		ИЛИ ИмяГруппы = Неопределено Тогда
		
		ДинамическиеПараметры = Новый Массив;
		
		Если Форма.Объект.СверятьСДаннымиОФД Тогда
			ДинамическиеПараметры.Добавить(НСтр("ru='Сверять данные за смену с данными ОФД'"));
		КонецЕсли;
		
		УстановитьЗаголовокСвернутогоОтображения(Форма, Форма.Элементы.ГруппаОФД.Имя, ДинамическиеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображения(Форма, НазваниеГруппы, ДинамическиеПараметры)

	МассивПараметров = Новый Массив;	
	
	Для Каждого Параметр Из ДинамическиеПараметры Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			МассивПараметров.Добавить(Параметр);
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = Форма.Элементы[НазваниеГруппы].Заголовок 
		+ ?(МассивПараметров.Количество(), ": " + СтрСоединить(МассивПараметров, ", "), "");

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНастройкиСБП(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ПересчитатьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КассыОФДЗагрузкаОтчетовЗавершение(Результат, Параметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Неопределено;
	ЕстьНесопоставленныеТовары = Результат.Свойство("НесопоставленныеТоварыОФД") И Результат.НесопоставленныеТоварыОФД.Количество() > 0;
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("ОписаниеОшибки") Тогда
		
		Если НЕ ЕстьНесопоставленныеТовары Тогда
			ПоказатьПредупреждение(Неопределено, Результат.ОписаниеОшибки, 10);
		Иначе
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ОписаниеОшибки", Результат.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьНесопоставленныеТовары Тогда
		
		ОповещениеОСопоставлении = Новый ОписаниеОповещения(
			"СопоставлениеТоваровОФДЗавершение",
			ЭтотОбъект,
			ДополнительныеПараметры);
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НесопоставленныеТоварыОФД", Результат.НесопоставленныеТоварыОФД);
		ПараметрыФормы.Вставить("СопоставлениеПослеЗагрузки", Истина);
			
		ОткрытьФорму("РегистрСведений.СопоставлениеНоменклатурыОФД.Форма.ФормаСопоставленияТоваров", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОСопоставлении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеТоваровОФДЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И
		Результат.Свойство("СопоставлениеВыполнено") И 
		Результат.СопоставлениеВыполнено Тогда
		
		Если Параметры.Свойство("ОписаниеОшибки") Тогда
			ПоказатьПредупреждение(Неопределено, Параметры.ОписаниеОшибки, 10);
		КонецЕсли;
		
		ОповещениеОВыполнении = Новый ОписаниеОповещения(
			"КассыОФДЗагрузкаОтчетовЗавершение",
			ЭтотОбъект);
		МенеджерОфлайнОборудованияКлиент.НачатьЗагрузкуДанныхИзККМ(Объект.ОфлайнОборудование, УникальныйИдентификатор, ОповещениеОВыполнении);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОфлайнОборудованиеПриИзмененииНаСервере()
	
	Если Объект.ОфлайнОборудование.ТипОфлайнОборудования = Перечисления.ТипыОфлайнОборудования.ОФД Тогда
		Элементы.ЗагрузитьДанныеОПродажах.Видимость = Истина;
	Иначе
		Элементы.ЗагрузитьДанныеОПродажах.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуПоказыватьИнформациюПоОблачнойКассе()

	ХранилищеСистемныхНастроек.Сохранить(
		"КассыККМ", 
		"КассыККМ_ПоказыватьИнформациюПоОблачнойКассе", 
		Ложь);
	
КонецПроцедуры

#КонецОбласти
